In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('student_marks.csv')

In [3]:
df

     Student_Name  Maths  Physics  Chemistry  Computer_Science
0     Arjun Singh   49.0     55.0       48.0              80.0
1       Arjun Das   94.0     98.0       45.0              68.0
2    Vivaan Singh   95.0     40.0        NaN              49.0
3    Vivaan Patel   85.0      NaN       47.0               NaN
4       Sai Gupta    NaN      NaN        NaN              92.0
5     Aarav Mehta   87.0      NaN       78.0              66.0
6    Suresh Gupta   70.0     92.0        NaN               NaN
7    Aditya Patel   51.0     40.0        NaN              47.0
8     Rahul Reddy    NaN     51.0        NaN              83.0
9     Rahul Singh    NaN     56.0       90.0              55.0
10    Rahul Kumar    NaN      NaN       46.0               NaN
11        Sai Das   52.0      NaN        NaN               NaN
12  Karthik Reddy   36.0      NaN       83.0               NaN
13  Aditya Sharma   72.0     87.0        NaN               NaN
14   Nikhil Patel    NaN      NaN        NaN              76.0
15    Aarav Reddy    NaN      NaN       89.0              63.0
16    Rahul Singh   73.0     37.0        NaN              92.0
17  Karthik Kumar    NaN     68.0       63.0              58.0
18    Rahul Mehta   75.0     72.0        NaN              38.0
19    Vivaan Iyer   95.0      NaN        NaN               NaN
20      Sai Gupta   37.0      NaN       47.0              53.0
21    Rohan Verma    NaN      NaN        NaN               NaN
22    Arjun Gupta    NaN     49.0        NaN              98.0
23    Rohan Singh    NaN     50.0        NaN              67.0
24    Aarav Gupta    NaN     99.0        NaN              55.0
25   Suresh Kumar   90.0     64.0        NaN               NaN
26   Aditya Mehta   59.0     85.0       39.0              76.0
27    Aditya Iyer    NaN     78.0       92.0               NaN
28     Arjun Iyer   93.0     91.0        NaN               NaN
29  Karthik Gupta    NaN      NaN        NaN              88.0
30   Vivaan Patel   47.0      NaN        NaN              98.0
31     Sai Sharma    NaN     42.0        NaN               NaN
32   Vivaan Verma    NaN      NaN        NaN              98.0
33    Rahul Singh    NaN      NaN        NaN              88.0
34    Rahul Verma   43.0      NaN       77.0               NaN
35   Aditya Singh    NaN      NaN       60.0              57.0
36    Arjun Gupta   35.0     41.0        NaN              88.0
37    Rohan Verma   36.0      NaN        NaN              38.0
38    Aarav Gupta    NaN      NaN        NaN               NaN
39   Suresh Mehta    NaN      NaN       35.0              73.0
40   Suresh Gupta   49.0     98.0       48.0               NaN
41   Aditya Verma   75.0      NaN        NaN               NaN
42      Rohan Das    NaN     92.0       82.0              56.0
43    Arjun Verma   39.0     56.0       57.0               NaN
44  Karthik Kumar   52.0      NaN       69.0              62.0
45   Suresh Kumar    NaN     94.0        NaN               NaN
46   Nikhil Verma   90.0      NaN        NaN              93.0
47      Arjun Das    NaN      NaN        NaN              49.0
48    Rohan Gupta   37.0      NaN        NaN              85.0
49    Aarav Reddy    NaN     44.0        NaN               NaN

In [4]:
df.loc[3:36,'Computer_Science']

3      NaN
4     92.0
5     66.0
6      NaN
7     47.0
8     83.0
9     55.0
10     NaN
11     NaN
12     NaN
13     NaN
14    76.0
15    63.0
16    92.0
17    58.0
18    38.0
19     NaN
20    53.0
21     NaN
22    98.0
23    67.0
24    55.0
25     NaN
26    76.0
27     NaN
28     NaN
29    88.0
30    98.0
31     NaN
32    98.0
33    88.0
34     NaN
35    57.0
36    88.0
Name: Computer_Science, dtype: float64

In [5]:
df.loc[7,'Physics']

np.float64(40.0)

In [6]:
df.loc[7,['Physics','Maths','Chemistry']]

Physics      40.0
Maths        51.0
Chemistry     NaN
Name: 7, dtype: float64

In [7]:
df.loc[5:10,['Student_Name','Computer_Science']]

    Student_Name  Computer_Science
5    Aarav Mehta              66.0
6   Suresh Gupta               NaN
7   Aditya Patel              47.0
8    Rahul Reddy              83.0
9    Rahul Singh              55.0
10   Rahul Kumar               NaN

In [8]:
df.loc[19]

Student_Name        Vivaan Iyer
Maths                      95.0
Physics                     NaN
Chemistry                   NaN
Computer_Science            NaN
Name: 19, dtype: object

In [9]:
df.loc[[10,20,40]]

    Student_Name  Maths  Physics  Chemistry  Computer_Science
10   Rahul Kumar    NaN      NaN       46.0               NaN
20     Sai Gupta   37.0      NaN       47.0              53.0
40  Suresh Gupta   49.0     98.0       48.0               NaN

In [10]:
df.iloc[0,0]

'Arjun Singh'

In [11]:
df.iloc[1,4]

np.float64(68.0)

In [12]:
df.iloc[[1,7]]

   Student_Name  Maths  Physics  Chemistry  Computer_Science
1     Arjun Das   94.0     98.0       45.0              68.0
7  Aditya Patel   51.0     40.0        NaN              47.0

In [13]:
df.iloc[1:8]

   Student_Name  Maths  Physics  Chemistry  Computer_Science
1     Arjun Das   94.0     98.0       45.0              68.0
2  Vivaan Singh   95.0     40.0        NaN              49.0
3  Vivaan Patel   85.0      NaN       47.0               NaN
4     Sai Gupta    NaN      NaN        NaN              92.0
5   Aarav Mehta   87.0      NaN       78.0              66.0
6  Suresh Gupta   70.0     92.0        NaN               NaN
7  Aditya Patel   51.0     40.0        NaN              47.0

In [14]:
df.iloc[0:10,0:3]

   Student_Name  Maths  Physics
0   Arjun Singh   49.0     55.0
1     Arjun Das   94.0     98.0
2  Vivaan Singh   95.0     40.0
3  Vivaan Patel   85.0      NaN
4     Sai Gupta    NaN      NaN
5   Aarav Mehta   87.0      NaN
6  Suresh Gupta   70.0     92.0
7  Aditya Patel   51.0     40.0
8   Rahul Reddy    NaN     51.0
9   Rahul Singh    NaN     56.0